IDEA Open Model
ConcreteULSCheckResultFatigue Class
Compatible with IDEA StatiCa Beta 20.0
 ULS Check Fatigue base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultFatigue
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultFatigueEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class ConcreteULSCheckResultFatigue : ConcreteCheckResultBase
Public MustInherit Class ConcreteULSCheckResultFatigue
	Inherits ConcreteCheckResultBase
The ConcreteULSCheckResultFatigue type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultFatigue
Initializes a new instance of the ConcreteULSCheckResultFatigue class
Top
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace